"use strict";
/* Ex.5
 * Въведете три стойности от клавиатурата – час(целочислен тип), сума пари(число с плаваща запетая), дали съм здрав(булев тип).
 * Съставете програма, която взема решения на базата на тези данни по следния начин: 
 * - ако съм болен няма да излизам 
 * - ако имам пари ще си купя лекарства 
 * - ако нямам – ще стоя вкъщи и ще пия чай 
 * - ако съм здрав 
 * - ако имам по-малко от 10 лв ще отида на кафе и т.н. 
 * Полученото решение покажете като съобщение в конзолата.
 */
var hour = parseInt(prompt('Час:'));
var money = parseFloat(prompt('Пари:').replace(',', '.'));
var isSick = parseInt(prompt('Болен ли си: Да(1)/Не(0)'));
if (isSick) {
	if (money != 0) {
		console.log('Ще си купя лекарства и ще си стоя вкъщи')
	} else {
		console.log('Ще стоя вкъщи и ще пия чай');
	}
} else {
	if (money < 10) {
		console.log('Ще отида на кафе в ' + hour + 'часа');
	} else{
		console.log('Ще се чудя къде да си изхарча парите');
	}
}
